# FilterStringBeginsWith Properties

---
The FilterStringBeginsWith type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from FilterStringRuleEvaluator)
Top
#### Reference
FilterStringBeginsWith Class
Autodesk.Revit.DB Namespace